app/controllers/issues_controller.rb

INSERT INTO "issues" ("name", "description", "status", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sem tempo Irmão"], ["description", "assssppp"], ["status", "Pronto"], ["created_at", "2020-03-08 22:21:20.391090"], ["updated_at", "2020-03-08 22:21:20.391090"], ["project_id", 5]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @issue = Issue.new(issues_params)
    respond_to do |format|
      if @issue.save
        @project = Project.find(@issue.project_id)

UPDATE "issues" SET "description" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["description", "assssppp"], ["updated_at", "2020-03-08 22:21:03.334542"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @issue.update(issues_params)

DELETE FROM "issues" WHERE "issues"."id" = $1  [["id", 3]]
---
  def destroy
    @issue.destroy

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_issue
      @issue = Issue.find(params[:id])