app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND (lower(name) LIKE '%car%') ORDER BY "projects"."name" ASC  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" ORDER BY "projects"."name" ASC
---
  def index
    @msg = nil;
    @projects = Project.where( user_id:current_user.id).order(:name)
    if !params[:search].nil?
      @search_term = params[:search]
      @projects = @projects.where('lower(name) LIKE ?', "%#{@search_term.downcase}%")
      if @projects.blank?

INSERT INTO "projects" ("name", "description", "budgeted", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aaaaaaaa"], ["description", ""], ["budgeted", "0.0"], ["status", "aaaaaaaaa"], ["created_at", "2020-03-07 16:50:29.435169"], ["updated_at", "2020-03-07 16:50:29.435169"]]
---
  def create
    @project = Project.new(projects_params)
    @project.user_id = current_user.id
    respond_to do |format|
      if @project.save

UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "Projeto sem Datas"], ["updated_at", "2020-03-08 21:21:13.385097"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project.update(projects_params)

SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = $1 AND (lower(name) LIKE '%aa%')  [["project_id", 7]]
---
    def set_issues
      if @issues = Issue.where(project_id: @project.id)